In [2]:
import pandas as pd
user_series = pd.Series([1, 5, 9, 8,10])
user_series

0     1
1     5
2     9
3     8
4    10
dtype: int64

In [5]:
student_name = pd.Series(['Ram', 'Shyam', 'Hari'])
student_address = pd.Series(['ktm', 'ltpr', 'bkt'])

In [6]:
student_name

0      Ram
1    Shyam
2     Hari
dtype: object

In [7]:
student_address

0     ktm
1    ltpr
2     bkt
dtype: object

In [8]:
#DataFrame

In [11]:
df = pd.DataFrame({'name' :student_name, 'address' :student_address})

In [12]:
df

    name address
0    Ram     ktm
1  Shyam    ltpr
2   Hari     bkt

In [16]:
df = pd.read_csv('info.csv')
df

       name  age   address  mark
0       ram   21       ktm  77.5
1     shyan   22       bkt  78.5
2      hari   23      ltpr  76.5
3      sita   24       okl  75.5
4      nita   25      dhrn  74.5
5     nisha   26     sindu  73.5
6    anisha   27     kavre  72.5
7     tracy   28  ramechap  71.5
8     milan   29       pkr  70.5
9   avishek   30       brt  79.5
10     ugen   31       bla  80.0

In [17]:
df['name']

0         ram
1       shyan
2        hari
3        sita
4        nita
5       nisha
6      anisha
7       tracy
8       milan
9     avishek
10       ugen
Name: name, dtype: object

In [18]:
df['age']

0     21
1     22
2     23
3     24
4     25
5     26
6     27
7     28
8     29
9     30
10    31
Name: age, dtype: int64

In [20]:
df['mark']

0     77.5
1     78.5
2     76.5
3     75.5
4     74.5
5     73.5
6     72.5
7     71.5
8     70.5
9     79.5
10    80.0
Name: mark, dtype: float64

In [21]:
df.head() #prints first five

    name  age address  mark
0    ram   21     ktm  77.5
1  shyan   22     bkt  78.5
2   hari   23    ltpr  76.5
3   sita   24     okl  75.5
4   nita   25    dhrn  74.5

In [25]:
df.tail()

       name  age   address  mark
6    anisha   27     kavre  72.5
7     tracy   28  ramechap  71.5
8     milan   29       pkr  70.5
9   avishek   30       brt  79.5
10     ugen   31       bla  80.0

In [27]:
df[2:6]

    name  age address  mark
2   hari   23    ltpr  76.5
3   sita   24     okl  75.5
4   nita   25    dhrn  74.5
5  nisha   26   sindu  73.5

In [28]:
pwd #folder ko location herna milxa

'C:\\Users\\MilanKhatiwada\\Desktop\\jupyter'

In [29]:
df['name']

0         ram
1       shyan
2        hari
3        sita
4        nita
5       nisha
6      anisha
7       tracy
8       milan
9     avishek
10       ugen
Name: name, dtype: object

In [30]:
df

       name  age   address  mark
0       ram   21       ktm  77.5
1     shyan   22       bkt  78.5
2      hari   23      ltpr  76.5
3      sita   24       okl  75.5
4      nita   25      dhrn  74.5
5     nisha   26     sindu  73.5
6    anisha   27     kavre  72.5
7     tracy   28  ramechap  71.5
8     milan   29       pkr  70.5
9   avishek   30       brt  79.5
10     ugen   31       bla  80.0

In [31]:
df = pd.read_csv('info.csv')

In [32]:
df

    sn     name  age   address  mark
0    1      ram   21       ktm  77.5
1    2    shyan   22       bkt  78.5
2    3     hari   23      ltpr  76.5
3    4     sita   24       okl  75.5
4    5     nita   25      dhrn  74.5
5    6    nisha   26     sindu  73.5
6    7   anisha   27     kavre  72.5
7    8    tracy   28  ramechap  71.5
8    9    milan   29       pkr  70.5
9   10  avishek   30       brt  79.5
10  11     ugen   31       bla  80.0

In [38]:
df = pd.read_csv('info.csv', index_col ='sn')
df

       name  age   address  mark
sn
1       ram   21       ktm  77.5
2     shyan   22       bkt  78.5
3      hari   23      ltpr  76.5
4      sita   24       okl  75.5
5      nita   25      dhrn  74.5
6     nisha   26     sindu  73.5
7    anisha   27     kavre  72.5
8     tracy   28  ramechap  71.5
9     milan   29       pkr  70.5
10  avishek   30       brt  79.5
11     ugen   31       bla  80.0

In [40]:
df = pd.read_csv('info.csv', index_col ='name')
df

SyntaxError: positional argument follows keyword argument (1210011743.py, line 1)